#include<stdio.h>


int mask;
int prtBin(int _num) {
	for(int i=31; i>=0; i--) {
	             mask  = 1 << i;
	             printf("%d", _num & mask ? 1 : 0);
		
                if(i%8 == 0)
	               printf(" ");

	         }
         printf("\n");

		return 0;
}

int main() {
	/*
	 *   0x9e에서 첫 번째와 마지막 비트 반전 
	 *   0x9e^0x81 
	 *   00000000 00000000 00000000 10011110 
	 *   00000000 00000000 00000000 00011111
	 *
	 *   0x00에서 첫 번째와 마지막 비트 1로 set
	 *	 0x00 | 0x81;
	 *	
	 *	 00000000 00000000 00000000 00000000 
	 *	 00000000 00000000 00000000 10000001
	 *
	 *
	 *	0x00에서 각 바이트의 첫 번째 비트 1로 set
	 *	0x00 | 0x80808080;
	 *
	 *  00000000 00000000 00000000 00000000 
	 *  10000000 10000000 10000000 10000000
	 *
	 *
	 *	
	 *
	 *
	 *
	 *
	 *
	 */
	
	int num = 0x00;
	prtBin(num);
	// 1001 1110
	
	//첫 번째 , 마지막 비트 반전 
	num = num |  0x80808080;
	prtBin(num);
	
}


